Repository: anajjar01/reservations_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# getStarted
source: Sign Up
ar: حساب جديد

source: Log In
ar: تسجيل الدخول

source: Log in Now
ar: سجل دخول الان

# titleOnboarding1
source: Challenges of booking appointments remotely
ar: تحديات حجز المواعيد الدراسية عن بعد

# titleOnboarding2
source: The importance of pre-booking appointments
ar: أهمية حجز المواعيد الدراسية المسبقة

# titleOnboarding3
source: How to schedule lessons effectively
ar: كيفية تحديد مواعيد الدروس بشكل فعال

# descOnboarding1
source: Difficulties in booking appointments remotely and how to overcome them using technology.
ar: صعوبات حجز المواعيد الدراسية عن بعد وكيفية التغلب عليها باستخدام التقنية

# descOnboarding2
source: Pre-booking school appointments is important for improving the quality of education and enhancing interaction and communication between students and teachers.
ar: يناقش أهمية حجز المواعيد الدراسية المسبقة وتأثيرها على جودة التعليم وتحسين التفاعل والتواصل بين الطالب والمعلم

# descOnboarding3
source: This provides guidance for scheduling study dates that suit both students and teachers, saving time and effort while ensuring an effective study environment.
ar: يقدم نصائح وإرشادات لتحديد المواعيد الدراسية المناسبة التي تتناسب مع جدول الطالب والمعلم وتوفير الوقت والجهد للجانبين، وتوفير بيئة دراسية فعالة

source: English
ar: إنجليزي

source: Add image
ar: اضافة صورة

source: Job ID
ar: الرقم الوظيفي

source: University No
ar: رقم الجامعي

# username
source: Userame
ar: اسم المستخدم

# enterEmail
source: Enter the Email
ar: ادخل البريد الالكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: User Type
ar: نوع المستخدم

source: lecturer
ar: محاضر

source: Student
ar: طالب

source: Welcome Back
ar: اهلا بعودتك

# forgotPassword
source: Forgot your Password ?
ar: نسيت كلمة المرور ؟

source: You can sign up here
ar: يمكنك التسجيل هنا

source: Reservations
ar: حجوزات

source: Student Appointments
ar: مواعيد الطلبة

source: Add appointments
ar: اضافة مواعيد

source: Profile Personly
ar: الملف الشخصي

source: Title
ar: العنوان

source: Topic Title
ar: عنوان الموضوع

# topicDescription
source: Topic description (optional)
ar: وصف الموضوع (اختياري)

source: The Appointment
ar: الموعد

source: day
ar: يوم

source: from the hour
ar: من الساعة

source: to the hour
ar: الى الساعة

source: to
ar: الى

source: Expected Duration
ar: المدة المتوقعة

source: Duration in Minutes
ar: المدة بالدقائق

# acceptanceOfReservation
source: Acceptance
ar: قبول الحجز

source: Refusal
ar: رفض

source: Start the Lecture
ar: بدء المحاضرة

source: Pending
ar: قيد الانتظار

source: Underway
ar: قيد التنفيذ

source: Ended
ar: المنتهية

source: Ending
ar: انتهاء

source: Save
ar: حفظ

source: Email
ar: البريد الالكتروني

source: Reservation dates
ar: مواعيد الحجز

# addAppointment
source: Add an Appointment
ar: اضافة موعد

# choosePeriods
source: You can choose booking periods for students between 8 AM and 3 PM
ar: يمكنك اختيار فترات حجز للطلبة ما بين ٨ الصباح و ٣ مساء

source: Addition
ar: اضافة

source: Cancel
ar: إلغاء

# mustFilledOut
source: The above field must be filled out
ar: يجب ملء الحقل أعلاه

# timesCorrectly
source: Enter the times correctly
ar: ادخل الاوقات بالشكل الصحيح

# timePeriodContaining
source: The time period containing
ar: الفترة الزمنية التي تحتوي على

source: is between
ar: يتراوح ما بين

source: and
ar: و

# periodContainedWithinOtherPeriods
source: The entered period is contained within other periods
ar: الفترة المدخلة موجودة ضمن فترات اخرى

source: Notifications
ar: إشعارات

source: Lecturer's dates
ar: مواعيد المحاضرين

source: Lecturers
ar: المحاضرين

source: My bookings
ar: حجوزاتي

source: Reservation Request
ar: طلب حجز

# messageCheckEmail
source: Please, check your email to activate the account.
ar: من فضلك ، تحقق من بريدك الإلكتروني لتفعيل الحساب.

# checkEmailToResetPassword
source: Please check your email to reset a new password
ar: رجاء راجع البريد الالكتروني الخاص بك لأعادة تعيين كلمة مرور جديدة

# emailAlreadyInUse
source: Email is in use
ar: البريد الالكتروني قيد الاستخدام

# invalidEmail
source: wrong email
ar: بريد إلكتروني خاطئ

# operationNotAllowed
source: Operation is not allowed
ar: العملية غير مسموح بها

source: Weak password
ar: كلمة مرور ضعيفة

# userDisabled
source: Disable user
ar: تعطيل المستخدم

source: Wrong password
ar: كلمة مرور خاطئة

# userNotFound
source: It was not found on the user
ar: لم يتم العثور على المستخدم

source: Please fill in the field above
ar: يرجى ملء الحقل أعلاه

# checkTwoPasswordsTheSame
source: Check that the two passwords are the same
ar: تحقق من تشابه كلمتا السر

source: Check the email
ar: تحقق من البريد الإلكتروني

# personalPhotoRequired
source: Personal photo is required
ar: صورة شخصية مطلوبة

# anErrorOccurredTryAgainLater
source: An error occurred, please try again later
ar: حدث خطأ ما يرجى المحاولة فيما بعد

source: operation accomplished successfully
ar: تمت العملية بنجاح

source: An error occurred, please try again later
ar: حدث خطأ ما يرجى المحاولة فيما بعد

# cancelReservations
source: Cancel
ar: الغاء الحجز

source: logout
ar: تسجيل الخروج

source: Forgot your password
ar: نسيت كلمة المرور

# enterEmailhelpFindPassword
source: Enter your email to help you find your password
ar: ادخل البريد الالكتروني لمساعدتك على ايجاد كلمة المرور الخاصة بك

# thereNoData
source: There is no data at this time
ar: لا يوجد بيانات في الوقت الحالي

source: Accept
ar: قبول

source: The lecturer did
ar: لقد قام المحاضر

source: End the session with the student
ar: بإنهاء الجلسة مع الطالب

source: End the session with the lecturer
ar: انهاء الجلسة مع المحاضر

# acceptanceOfBookingSessionWithTheLecturer
source: Acceptance Of Booking A Session With The Lecturer
ar: قبول حجز جلسة مع المحاضر

# addingAvailableDatesReservation
source: By adding available dates for reservation
ar: بإضافة مواعيد متاحة للحجز

# availabilityBookAppointment
source: Availability to book An Appointment
ar: إتاحة حجز موعد

# acceptingStudentReservation
source: By accepting the student's reservation
ar: بقبول حجز الطالب

source: Arabic
ar: العربية
